backend/app/services/import_service.rb

  def locations
    @checked_data["Location"].map do |location|
      Location.find_or_create_by(name: location.titlecase)
---
INSERT INTO "locations" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Death Star"], ["created_at", "2025-02-27 14:00:42.472267"], ["updated_at", "2025-02-27 14:00:42.472267"]]
SELECT "locations".* FROM "locations" WHERE "locations"."name" = $1 LIMIT $2  [["name", "Death Star"], ["LIMIT", 1]]

  def affiliations
    @checked_data["Affiliations"].map do |affiliation|
      Affiliation.find_or_create_by(name: affiliation.titlecase)
---
INSERT INTO "affiliations" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Sith"], ["created_at", "2025-02-27 14:00:42.489470"], ["updated_at", "2025-02-27 14:00:42.489470"]]
SELECT "affiliations".* FROM "affiliations" WHERE "affiliations"."name" = $1 LIMIT $2  [["name", "Sith"], ["LIMIT", 1]]