backend/app/controllers/people_controller.rb

SELECT "affiliations".* FROM "affiliations" INNER JOIN "affiliations_people" ON "affiliations"."id" = "affiliations_people"."affiliation_id" WHERE "affiliations_people"."person_id" = $1  [["person_id", 72]]
SELECT "locations".* FROM "locations" WHERE "locations"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12)  [["id", 1], ["id", 2], ["id", 3], ["id", 4], ["id", 5], ["id", 6], ["id", 7], ["id", 8], ["id", 9], ["id", 10], ["id", 11], ["id", 12]]
---
  def index
    @people = Person.preload(:locations, :affiliations).all